# 'brew tap'
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# set arguments for all 'brew install --cask' commands
# cask_args appdir: "/Applications", require_sha: true
cask_args appdir: "/Applications"



# 'brew install --cask'
brew "git"
# 配置 zsh
cask "iterm2"
# starship
cask "font-hack-nerd-font"
# 'brew install'
brew "zsh"
brew "starship"


# 查看目录列表，tree -L 1 , -L 指定最大深度
brew "tree"
# 目录环境变量 .envrc export GIT_SSH_COMMAND="ssh -i ~/.ssh/id_rsa_rba"
brew "direnv"
brew "autojump"
brew "jq"
brew "python"
brew "python"
brew "gnupg"
brew "pinentry-mac"
brew "libjwt"
brew "openjdk@11"

# aws k8s 相关
brew "awscli"
brew "aws-iam-authenticator"
brew "kubectl"
brew "terraform"
brew "fzf"
brew "kubectx"
brew "helm"



# 'brew install --cask'
# 日常使用 app
cask "google-chrome"
cask "visual-studio-code"
cask "snipaste"
cask "1password"
cask "caffeine"
cask "postman"
cask "qq"
cask "wechat"
cask "zoom"
